In [39]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
%matplotlib inline

In [40]:
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
obj2 = pd.Series([1,2,3,4], index = ['d','b','a','c'])
obj2

d    1
b    2
a    3
c    4
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2[obj2>2]

a    3
c    4
dtype: int64

In [12]:
obj*2

0    2
1    4
2    6
3    8
dtype: int64

In [42]:
sdata = {'ohio':3000, 'oregon':5000,'utah':6000,'nevada':7000}
sdata

{'ohio': 3000, 'oregon': 5000, 'utah': 6000, 'nevada': 7000}

In [16]:
obj3 = pd.Series(sdata)
obj3

ohio      3000
oregon    5000
utah      6000
nevada    7000
dtype: int64

In [17]:
states = ['ohio','oregon','california','nevada']

pd.Series(sdata, index = states)

ohio          3000.0
oregon        5000.0
california       NaN
nevada        7000.0
dtype: float64

In [19]:
obj3

ohio      3000
oregon    5000
utah      6000
nevada    7000
dtype: int64

In [24]:
obj3.name = 'population'
obj3.index.name = 'state'
obj3

state
ohio      3000
oregon    5000
utah      6000
nevada    7000
Name: population, dtype: int64

In [35]:
data = pd.DataFrame({'pop':[2000,3000,4000,5000], 'states':['Utah','nevada','oregon','florida']})
data

    pop   states
0  2000     Utah
1  3000   nevada
2  4000   oregon
3  5000  florida

In [43]:
pd.DataFrame(data, columns = ['pop','states','age'])

    pop   states  age
0  2000     Utah  NaN
1  3000   nevada  NaN
2  4000   oregon  NaN
3  5000  florida  NaN

In [46]:
data = {'state':['ohio','nevada','utah','oregon'],
        'pop':[1.2,2.5,0.8,1.3],
       'year':[1998,2001,2002,1999]}
data

{'state': ['ohio', 'nevada', 'utah', 'oregon'],
 'pop': [1.2, 2.5, 0.8, 1.3],
 'year': [1998, 2001, 2002, 1999]}

In [47]:
frame = pd.DataFrame(data)
frame

    state  pop  year
0    ohio  1.2  1998
1  nevada  2.5  2001
2    utah  0.8  2002
3  oregon  1.3  1999

In [50]:
frame = pd.DataFrame(data, columns = ['year','pop','state'])
frame

   year  pop   state
0  1998  1.2    ohio
1  2001  2.5  nevada
2  2002  0.8    utah
3  1999  1.3  oregon

In [51]:
frame2 = pd.DataFrame(data, columns = ['state','year','pop','debt'], index = ['one','two','three','four'])
frame2

        state  year  pop debt
one      ohio  1998  1.2  NaN
two    nevada  2001  2.5  NaN
three    utah  2002  0.8  NaN
four   oregon  1999  1.3  NaN

In [53]:
frame2["debt"]

one      NaN
two      NaN
three    NaN
four     NaN
Name: debt, dtype: object

In [54]:
frame2.year

one      1998
two      2001
three    2002
four     1999
Name: year, dtype: int64

In [55]:
frame2['debt'] = 26.5
frame2

        state  year  pop  debt
one      ohio  1998  1.2  26.5
two    nevada  2001  2.5  26.5
three    utah  2002  0.8  26.5
four   oregon  1999  1.3  26.5

In [57]:
frame2['debt'] = np.arange(4.0)
frame2

        state  year  pop  debt
one      ohio  1998  1.2   0.0
two    nevada  2001  2.5   1.0
three    utah  2002  0.8   2.0
four   oregon  1999  1.3   3.0

In [59]:
DebtVal = pd.Series([16.8, 12.5,20.4], index = ['two','three','four'])
frame2.debt = DebtVal
frame2

        state  year  pop  debt
one      ohio  1998  1.2   NaN
two    nevada  2001  2.5  16.8
three    utah  2002  0.8  12.5
four   oregon  1999  1.3  20.4

In [61]:
AvgAge = pd.Series([34,28,31,30], index = ['one','two','three','four'])
frame2['AvgAge'] = AvgAge
frame2

        state  year  pop  debt  AvgAge
one      ohio  1998  1.2   NaN      34
two    nevada  2001  2.5  16.8      28
three    utah  2002  0.8  12.5      31
four   oregon  1999  1.3  20.4      30

In [63]:
del frame2['AvgAge']

In [65]:
frame2.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [66]:
frame3 = frame2.T
frame3

        one     two three    four
state  ohio  nevada  utah  oregon
year   1998    2001  2002    1999
pop     1.2     2.5   0.8     1.3
debt    NaN    16.8  12.5    20.4

In [68]:
frame2.index.name = 'index'

In [69]:
frame2

        state  year  pop  debt
index
one      ohio  1998  1.2   NaN
two    nevada  2001  2.5  16.8
three    utah  2002  0.8  12.5
four   oregon  1999  1.3  20.4

In [72]:
# Reindexing

obj = pd.Series([3.2,4.5,7.1,8.3], index = ['d','b','a','c'])
obj

d    3.2
b    4.5
a    7.1
c    8.3
dtype: float64

In [74]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    7.1
b    4.5
c    8.3
d    3.2
e    NaN
dtype: float64

In [75]:
obj3 = pd.Series(['blue','purple','orange'],index = [0,2,4])
obj3

0      blue
2    purple
4    orange
dtype: object

In [76]:
obj3 = obj3.reindex(range(6), method ='ffill')
obj3

0      blue
1      blue
2    purple
3    purple
4    orange
5    orange
dtype: object

In [78]:
#reindex can alter both index and columns. but when passed as a sequence, it reindexes the rows.

frame = pd.DataFrame(np.arange(9).reshape(3,3), 
                    index = [2,4,6],
                    columns = ['ohio','utah','oregon'])
frame

   ohio  utah  oregon
2     0     1       2
4     3     4       5
6     6     7       8

In [79]:
frame = frame.reindex([1,2,3,4,5,6])
frame

   ohio  utah  oregon
1   NaN   NaN     NaN
2   0.0   1.0     2.0
3   NaN   NaN     NaN
4   3.0   4.0     5.0
5   NaN   NaN     NaN
6   6.0   7.0     8.0

In [81]:
states = ['ohio','nevada','utah','florida','oregon']
frame2 = frame.reindex(columns = states)
frame2

   ohio  nevada  utah  florida  oregon
1   NaN     NaN   NaN      NaN     NaN
2   0.0     NaN   1.0      NaN     2.0
3   NaN     NaN   NaN      NaN     NaN
4   3.0     NaN   4.0      NaN     5.0
5   NaN     NaN   NaN      NaN     NaN
6   6.0     NaN   7.0      NaN     8.0

In [83]:
obj = pd.DataFrame(['blue','purple','orange'], index = [2,4,6])
obj

        0
2    blue
4  purple
6  orange

In [84]:
obj = obj.reindex(np.arange(6), method = 'bfill')
obj

        0
0    blue
1    blue
2    blue
3  purple
4  purple
5  orange

In [86]:
# Dropping entries for an axis

obj = obj.drop(2)

In [87]:
obj

        0
0    blue
1    blue
3  purple
4  purple
5  orange

In [88]:
# dropping two rows simultaneously
obj = obj.drop([1,4])
obj

        0
0    blue
3  purple
5  orange

In [89]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index = ['ohio','utah','nevada','florida'],
                   columns=['one','two','three','four'])
data

         one  two  three  four
ohio       0    1      2     3
utah       4    5      6     7
nevada     8    9     10    11
florida   12   13     14    15

In [90]:
# dropping two rows
data.drop(['ohio','nevada'])

         one  two  three  four
utah       4    5      6     7
florida   12   13     14    15

In [92]:
# dropping a column
data.drop(['two'], axis = 1)

         one  three  four
ohio       0      2     3
utah       4      6     7
nevada     8     10    11
florida   12     14    15

In [94]:
obj.drop([3])

        0
0    blue
5  orange

In [98]:
obj.drop([0], inplace = True)
obj

        0
5  orange

In [99]:
data

         one  two  three  four
ohio       0    1      2     3
utah       4    5      6     7
nevada     8    9     10    11
florida   12   13     14    15

In [104]:
data.loc['utah',['two','three']]

two      5
three    6
Name: utah, dtype: int32

In [103]:
data.iloc[1,[1,2]]

two      5
three    6
Name: utah, dtype: int32

In [108]:
data.iloc[[2]]

        one  two  three  four
nevada    8    9     10    11

In [110]:
data.iloc[[1,3],[3,2]]

         four  three
utah        7      6
florida    15     14

In [111]:
data.loc[:'utah','two']

ohio    1
utah    5
Name: two, dtype: int32

In [112]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [113]:
ser[-1]

# our indexing is integer hence, we received this error.

KeyError: -1

In [114]:
ser2 = pd.Series(np.arange(3.), index = ['one','two','three'])
ser2

one      0.0
two      1.0
three    2.0
dtype: float64

In [115]:
ser2[-1]

2.0

In [119]:
# In case of DataFrame, alignment happens on both rows and columns.

df1 = pd.DataFrame(np.arange(9).reshape(3,3),
                  index = ['ohio','utah','nevada'],
                  columns = ['one','two','three'])

df2 = pd.DataFrame(np.arange(9).reshape(3,3),
                  index=['ohio','florida','colorado'],
                  columns = ['two','three','four'])

In [120]:
df1+ df2

          four  one  three  two
colorado   NaN  NaN    NaN  NaN
florida    NaN  NaN    NaN  NaN
nevada     NaN  NaN    NaN  NaN
ohio       NaN  NaN    3.0  1.0
utah       NaN  NaN    NaN  NaN